[net]
batch=64
subdivisions=8
width=608
height=608
channels=3
momentum=0.949
decay=0.0005
angle=0
saturation=1.5
exposure=1.5
hue=.1
learning_rate=0.00261
burn_in=1000
max_batches=500500
policy=steps
steps=400000,450000
scales=.1,.1
mosaic=1

[convolutional]
batch_normalize=1
filters=16
size=3
stride=2
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=16
size=3
stride=1
pad=1
group=16
activation=relu6

[convolutional]
batch_normalize=1
filters=15
size=1
stride=1
pad=1
group=1
activation=linear

[convolutional]
batch_normalize=1
filters=36
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=36
size=3
stride=2
pad=1
group=36
activation=relu6

[convolutional]
batch_normalize=1
filters=24
size=1
stride=1
pad=1
group=1
activation=linear

[convolutional]
batch_normalize=1
filters=24
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=24
size=3
stride=1
pad=1
group=24
activation=relu6

[convolutional]
batch_normalize=1
filters=24
size=1
stride=1
pad=1
group=1
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=30
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=30
size=3
stride=2
pad=1
group=30
activation=relu6

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
group=1
activation=linear

[convolutional]
batch_normalize=1
filters=18
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=18
size=3
stride=1
pad=1
group=18
activation=relu6

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
group=1
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=11
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=11
size=3
stride=1
pad=1
group=11
activation=relu6

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
group=1
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=40
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=40
size=3
stride=2
pad=1
group=40
activation=relu6

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
group=1
activation=linear

[convolutional]
batch_normalize=1
filters=21
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=21
size=3
stride=1
pad=1
group=21
activation=relu6

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
group=1
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=14
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=14
size=3
stride=1
pad=1
group=14
activation=relu6

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
group=1
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=12
size=3
stride=1
pad=1
group=12
activation=relu6

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
group=1
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=35
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=35
size=3
stride=1
pad=1
group=35
activation=relu6

[convolutional]
batch_normalize=1
filters=96
size=1
stride=1
pad=1
group=1
activation=linear

[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=13
size=3
stride=1
pad=1
group=13
activation=relu6

[convolutional]
batch_normalize=1
filters=96
size=1
stride=1
pad=1
group=1
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=13
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=13
size=3
stride=1
pad=1
group=13
activation=relu6

[convolutional]
batch_normalize=1
filters=96
size=1
stride=1
pad=1
group=1
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=18
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=18
size=3
stride=2
pad=1
group=18
activation=relu6

[convolutional]
batch_normalize=1
filters=157
size=1
stride=1
pad=1
group=1
activation=linear

[convolutional]
batch_normalize=1
filters=9
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=9
size=3
stride=1
pad=1
group=9
activation=relu6

[convolutional]
batch_normalize=1
filters=157
size=1
stride=1
pad=1
group=1
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=10
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=10
size=3
stride=1
pad=1
group=10
activation=relu6

[convolutional]
batch_normalize=1
filters=157
size=1
stride=1
pad=1
group=1
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=19
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=19
size=3
stride=1
pad=1
group=19
activation=relu6

[convolutional]
batch_normalize=1
filters=108
size=1
stride=1
pad=1
group=1
activation=linear

[convolutional]
batch_normalize=1
filters=34
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=34
size=3
stride=1
pad=1
group=34
activation=relu6

[convolutional]
batch_normalize=1
filters=162
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
group=1
activation=relu6

[maxpool]
stride=1
size=5

[route]
layers=-2

[maxpool]
stride=1
size=9

[route]
layers=-4

[maxpool]
stride=1
size=13

[route]
layers=-1,-3,-5,-6

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=41
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=41
size=3
stride=1
pad=1
group=41
activation=relu6

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
group=1
activation=relu6

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=96
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
group=1
activation=relu6

[upsample]
stride=2

[route]
layers=46

[convolutional]
batch_normalize=1
filters=86
size=1
stride=1
pad=1
group=1
activation=relu6

[route]
layers=-1, -3

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=38
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=38
size=3
stride=1
pad=1
group=38
activation=relu6

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
group=1
activation=relu6

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=30
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=30
size=3
stride=1
pad=1
group=30
activation=relu6

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
group=1
activation=relu6

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=41
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
group=1
activation=relu6

[upsample]
stride=2

[route]
layers=20

[convolutional]
batch_normalize=1
filters=1
size=1
stride=1
pad=1
group=1
activation=relu6

[route]
layers=-1, -3

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=18
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=18
size=3
stride=1
pad=1
group=18
activation=relu6

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
group=1
activation=relu6

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=31
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=31
size=3
stride=1
pad=1
group=31
activation=relu6

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
group=1
activation=relu6

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=12
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=12
size=3
stride=1
pad=1
group=12
activation=relu6

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
group=1
activation=relu6

[shortcut]
from=-4
activation=linear

[yolohead]
batch_normalize=0
size=1
stride=1
pad=1

[route]
layers=-5

[convolutional]
batch_normalize=1
filters=12
size=3
stride=2
pad=1
group=12
activation=relu6

[convolutional]
batch_normalize=1
filters=1
size=1
stride=1
pad=1
group=1
activation=relu6

[route]
layers=-1, 91

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=7
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=7
size=3
stride=1
pad=1
group=7
activation=relu6

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
group=1
activation=relu6

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=10
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=10
size=3
stride=1
pad=1
group=10
activation=relu6

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
group=1
activation=relu6

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=24
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=24
size=3
stride=1
pad=1
group=24
activation=relu6

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
group=1
activation=relu6

[shortcut]
from=-4
activation=linear

[yolohead]
batch_normalize=0
size=1
stride=1
pad=1

[route]
layers=-5

[convolutional]
batch_normalize=1
filters=24
size=3
stride=2
pad=1
group=24
activation=relu6

[convolutional]
batch_normalize=1
filters=2
size=1
stride=1
pad=1
group=1
activation=relu6

[route]
layers=-1, 76

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=14
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=14
size=3
stride=1
pad=1
group=14
activation=relu6

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
group=1
activation=relu6

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=11
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=11
size=3
stride=1
pad=1
group=11
activation=relu6

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
group=1
activation=relu6

[shortcut]
from=-4
activation=linear

[convolutional]
batch_normalize=1
filters=11
size=1
stride=1
pad=1
group=1
activation=relu6

[convolutional]
batch_normalize=1
filters=11
size=3
stride=1
pad=1
group=11
activation=relu6

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
group=1
activation=relu6

[shortcut]
from=-4
activation=linear

[yolohead]
batch_normalize=0
size=1
stride=1
pad=1

